import json
from models import RiskQuestion
from apps import create_app
from bases.globals import db


def init_evaluation_questions():
    with create_app().app_context():
        for i in QUESTIONS:
            temp = i.get('temps')

            symbol = []
            answer = []
            score = []
            for j in temp:
                symbol.append(j[0])
                answer.append(j[1])
                score.append(j[2])

            new = RiskQuestion(
                order_num=i.get('order_num'),
                question=i.get('question'),
                symbol=json.dumps(symbol, ensure_ascii=False),
                answer=json.dumps(answer, ensure_ascii=False),
                score=json.dumps(score, ensure_ascii=False),
            )
            db.session.add(new)
        db.session.commit()


QUESTIONS = [
    {
        'order_num': 1,
        'question': '您的主要收入来源是:',
        'temps': [
            [
                'A',
                '工资、劳务报酬。',
                5,
            ],
            [
                'B',
                '生产经营所得。',
                4,
            ],
            [
                'C',
                '利息、股息、转让证券等金融性资产收入。',
                3,
            ],
            [
                'D',
                '出租、出售房地产等非金融性资产收入。',
                2,
            ],
            [
                'E',
                '无固定收入。',
                1,
            ],
        ]
    },
    {
        'order_num': 2,
        'question': '您的家庭可支配年收入（折合人民币）:',
        'temps': [
            [
                'A',
                '50万元以下',
                1,
            ],
            [
                'B',
                '50万-100万',
                2,
            ],
            [
                'C',
                '100万-500万',
                3,
            ],
            [
                'D',
                '500-1000万元',
                4,
            ],
            [
                'E',
                '1000万元以上',
                5,
            ],
        ]
    },
    {
        'order_num': 3,
        'question': '您每年的家庭可支配收入，可用于金融投资(储蓄存款除外)的比例为:',
        'temps': [
            [
                'A',
                '小于10%',
                1,
            ],
            [
                'B',
                '10%至25%',
                2,
            ],
            [
                'C',
                '25%至50%',
                3,
            ],
            [
                'D',
                '大于50%',
                4,
            ],
        ]
    },
    {
        'order_num': 4,
        'question': '您是否有尚未清偿的数额较大的债务，如有，其性质是:',
        'temps': [
            [
                'A',
                '没有。',
                4,
            ],
            [
                'B',
                '有，住房抵押贷款等长期定额债务。',
                3,
            ],
            [
                'C',
                '有，信用卡欠款、消费贷等短期信用债务。',
                2,
            ],
            [
                'D',
                '有，亲戚朋友借款。',
                1,
            ],
        ]
    },
    {
        'order_num': 5,
        'question': '您的投资知识可描述为:',
        'temps': [
            [
                'A',
                '有限：基本没有金融产品方面的知识。',
                1,
            ],
            [
                'B',
                '一般：对金融产品及其相关风险具有基本的知识和理解。',
                2,
            ],
            [
                'C',
                '丰富：对金融产品及其相关风险具有丰富的知识和理解。',
                3,
            ],
        ]
    },
    {
        'order_num': 6,
        'question': '您的投资经验可描述为:',
        'temps': [
            [
                'A',
                '除银行储蓄外，基本没有其他投资经验。',
                1,
            ],
            [
                'B',
                '购买过债券、保险等理财产品。',
                2,
            ],
            [
                'C',
                '参与过股票、基金等产品的交易。',
                3,
            ],
            [
                'D',
                '参与过权证、期货、期权等产品的交易。',
                4,
            ],
        ]
    },
    {
        'order_num': 7,
        'question': '您有多少年投资基金、股票、信托、私募证券或金融衍生产品等风险投资品的经验? ',
        'temps': [
            [
                'A',
                '没有经验',
                1,
            ],
            [
                'B',
                '少于2年',
                2,
            ],
            [
                'C',
                '2-5年',
                3,
            ],
            [
                'D',
                '5-10年',
                4,
            ],
            [
                'E',
                '10年以上',
                5,
            ],
        ]
    },
    {
        'order_num': 8,
        'question': '您计划的投资期限是多久？',
        'temps': [
            [
                'A',
                '一年以下',
                1,
            ],
            [
                'B',
                '1-3年',
                2,
            ],
            [
                'C',
                '3-5年',
                3,
            ],
            [
                'D',
                '5年以上',
                4,
            ],
        ]
    },
    {
        'order_num': 9,
        'question': '您打算重点投资于哪些种类的投资品种？',
        'temps': [
            [
                'A',
                '债券、货币市场基金、债券基金等固定收益类投资品种。',
                1,
            ],
            [
                'B',
                '股票、混合型基金、股票型基金等权益类投资品种。',
                2,
            ],
            [
                'C',
                '期货、期权等金融衍生品。',
                3,
            ],
            [
                'D',
                '其他产品或者服务。',
                4,
            ],
        ]
    },
    {
        'order_num': 10,
        'question': '以下哪项描述最符合您的投资态度？',
        'temps': [
            [
                'A',
                '厌恶风险，不希望本金损失，希望获得稳定回报。',
                1,
            ],
            [
                'B',
                '保守投资，不希望本金损失，愿意承担一定幅度的收益波动。',
                2,
            ],
            [
                'C',
                '寻求资金的较高收益和成长性，愿意为此承担有限本金损失。',
                3,
            ],
            [
                'D',
                '希望赚取高回报，愿意为此承担较大本金损失。',
                4,
            ],
        ]
    },
    {
        'order_num': 11,
        'question': '假设有两种投资：投资A预期获得10%收益，可承担的损失非常小；投资B预期获得30%收益，但可能承担较大亏损。您会怎么支配您的投资？',
        'temps': [
            [
                'A',
                '全部投资于A。',
                1,
            ],
            [
                'B',
                '同时投资于A和B，但大部分资金投资于收益较小且风险较小的A。',
                2,
            ],
            [
                'C',
                '同时投资于A和B，但大部分资金投资于收益较大且风险较大的B。',
                3,
            ],
            [
                'D',
                '全部投资于收益较大且风险较大的B。',
                4,
            ],
        ]
    },
    {
        'order_num': 12,
        'question': '您认为自己能承受的最大投资损失是多少？',
        'temps': [
            [
                'A',
                '10%以内',
                1,
            ],
            [
                'B',
                '10%-30%',
                2,
            ],
            [
                'C',
                '30%-50%',
                3,
            ],
            [
                'D',
                '超过50%',
                4,
            ],
        ]
    },
    {
        'order_num': 13,
        'question': '您的年龄？',
        'temps': [
            [
                'A',
                '18-30岁',
                0,
            ],
            [
                'B',
                '31-40岁',
                0,
            ],
            [
                'C',
                '51-60岁',
                0,
            ],
            [
                'D',
                '超过50%',
                0,
            ],
            [
                'E',
                '超过60岁',
                0,
            ],
        ]
    },
    {
        'order_num': 14,
        'question': '今后五年时间内，您的父母、配偶以及未成年子女等需负法定抚养、扶养和赡养义务的人数？',
        'temps': [
            [
                'A',
                '1-2人',
                0,
            ],
            [
                'B',
                '3-4人',
                0,
            ],
            [
                'C',
                '5人以上',
                0,
            ],
        ]
    },
    {
        'order_num': 15,
        'question': '您的收益目标？',
        'temps': [
            [
                'A',
                '超过银行同期存款',
                0,
            ],
            [
                'B',
                '超过银行同期理财产品',
                0,
            ],
            [
                'C',
                '跑赢偏股型基金平均值',
                0,
            ],
            [
                'D',
                '跑赢指数',
                0,
            ],
        ]
    },
]


if __name__ == '__main__':
    init_evaluation_questions()

