if (筛选条件 == '收益' || 筛选条件 == '业绩') {
    prefix_message = '筛选市场中收益能力强的基金，考虑其年化收益、累计收益等指标，筛选出以下基金：'
} else if (筛选条件 == '风险') {
    prefix_message = '筛选市场中抗风险能力强的基金，考虑其下行风险、最大回撤、年化波动率等指标，筛选出以下基金：'
} else if (筛选条件 == '稳定') {
    prefix_message = '筛选市场中稳定性强的基金，考虑其成立时长、基金规模、业绩持续性等指标，筛选出以下基金：'
} else if (筛选条件 == '选股') {
    prefix_message = '筛选市场中选股能力强的基金，考虑其历史选股收益等指标，筛选出以下基金：'
} else if (筛选条件 == '择时') {
    prefix_message = '筛选市场中抗风险能力强的基金，考虑其历史择时Beta等指标，筛选出以下基金：'
} else if (筛选条件 == '管理能力' || 筛选条件 == '基金经理' || 筛选条件 == '团队') {
    prefix_message = '筛选市场中团队能力强的基金，考虑其基金经理能力等指标，筛选出以下基金：'
}